Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.cloudflare_zone.bryanwp: Reading...
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.iso_image["1"] will be created
+ resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "http://channels.nixos.org/nixos-23.05/latest-nixos-minimal-x86_64-linux.iso"
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_cp" {
        id                      = "500"
        name                    = "cp.polaris-0"
        tags                    = [
            "cp",
            "k8s",
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ initialization {
            # (2 unchanged attributes hidden)

          ~ ip_config {
              ~ ipv4 {
                  ~ address = "192.168.2.99/32" -> "dhcp"
                  - gateway = "192.168.2.1" -> null
                }
            }
        }

        # (7 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e779aff7675f:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`